<template>
    <div>

        <QuestionTemplate v-bind:question=question></QuestionTemplate>

    </div>
</template>

<script>
// import ResultCard from "@/components/ResultCard.vue";
import QuestionTemplate from "@/components/QuestionTemplate.vue";
export default {
    name : 'Question',
    components : {
        QuestionTemplate,
    },
    data(){
        return{
            // scoree1: null,
            user: "",
            question:[
                {
                    number: 1,
                    ask: 'ปัจจุบันคุณอายุเท่าไหร่',
                    choice: [
                        { text: "มากกว่า 55 ปี" ,value: "1" },
                        { text: "45 – 55 ปี" ,value: "2" },
                        { text: "35 – 44 ปี" ,value: "3" },
                        { text: "น้อยกว่า 35 ปี" ,value: "4" }
                    ]
                },
                {
                    number: 2,
                    ask: 'ปัจจุบันคุณมีภาระค่าใช้จ่ายรายเดือน คิดเป็นกี่% ของรายได้ทั้งหมด',
                    choice: [
                        { text: "มากกว่า 75%" ,value: "1" },
                        { text: "51 - 75%" ,value: "2"},
                        { text: "25 - 50%" ,value: "3"},
                        { text: "น้อยกว่า 25%" ,value: "4"}
                    ]
                },
                {
                    number: 3,
                    ask: 'คุณมีสถานะทางการเงินในปัจจุบันอย่างไร',
                    choice: [
                        { text: "มีทรัพย์สินน้อยกว่าหนี้สิน" ,value: "1" },
                        { text: "มีทรัพย์สินเท่ากับหนี้สิน" ,value: "2"},
                        { text: "มีทรัพย์สินมากกว่าหนี้สิน" ,value: "3"},
                        { text: "มีความมั่นใจว่ามีเงินออม/เงินลงทุนเพียงพอสำหรับการใช้ชีวิตหลังเกษียณแล้ว" ,value: "4"}
                    ]
                },
                {
                    number: 4,
                    ask: 'คุณมีประสบการณ์ หรือมีความรู้ในการลงทุนในทรัพย์สินกลุ่มใดต่อไปนี้บ้าง',
                    choice: [
                        { text: "เงินฝากธนาคาร",value: "1"},
                        { text: "พันธบัตรรัฐบาล หรือกองทุนรวมพันธบัตรรัฐบาล" ,value: "2"},
                        { text: "หุ้นกู้ หรือกองทุนรวมตราสารหนี้" ,value: "3"},
                        { text: "หุ้นสามัญ หรือกองทุนรวมหุ้น หรือสินทรัพย์อื่นที่มีความเสี่ยงสูง" ,value: "4"}
                    ]
                },
                {
                    number: 5,
                    ask: 'คุณคาดว่าจะไม่มีความจำเป็ นต้องใช้เงินลงทุนนี้นานแค่ไหน',
                    choice: [
                        { text: "ไม่เกิน 1 ปี",value: "1"},
                        { text: "1 – 3 ปี" ,value: "2"},
                        { text: "3 – 5 ปี" ,value: "3"},
                        { text: "มากกว่า 5 ปี" ,value: "4"}
                    ]
                },
                {
                    number: 6,
                    ask: 'เป้าหมายหลักในการลงทุนของคุณ คือ',
                    choice: [
                        { text: "เงินต้นต้องไม่ลดลง และรับได้หากผลตอบแทนต่ำกว่าหรือใกล้เคียงอัตราเงินเฟ้อ",value: "1"},
                        { text: "ได้รับผลตอบแทนที่สูงกว่าอัตราเงินเฟ้อเล็กน้อย และรับความเสี่ยงที่จะขาดทุนเงินต้นได้บ้าง" ,value: "2"},
                        { text: "ได้รับผลตอบแทนที่สูงกว่าอัตราเงินเฟ้อ และรับความเสี่ยงที่จะขาดทุนเงินต้นได้มากขึ้น" ,value: "3"},
                        { text: "ได้รับผลตอบแทนที่สูงมาก และรับความเสี่ยงที่จะขาดทุนเงินต้นส่วนใหญ่ได้" ,value: "4"}
                    ]
                },
                {
                    number: 7,
                    ask: 'เมื่อพิจารณารูปแสดงตัวอย่างผลตอบแทนของกลุ่มการลงทุนที่อาจเกิดขึ้นด้านล่าง คุณเต็มใจที่จะลงทุนในแบบใด',
                    img: require('../assets/images/no7.svg'),
                    choice: [
                        { text: "แบบที่ 1 มีโอกาสได้รับผลตอบแทนสูงสุด 2.5% โดยไม่ขาดทุนเลย",value: "1"},
                        { text: "แบบที่ 2 มีโอกาสได้รับผลตอบแทนสูงสุด 7% แต่อาจขาดทุนได้ถึง 1%" ,value: "2"},
                        { text: "แบบที่ 3 มีโอกาสได้รับผลตอบแทนสูงสุด 15% แต่อาจขาดทุนได้ถึง 5%" ,value: "3"},
                        { text: "แบบที่ 4 มีโอกาสได้รับผลตอบแทนสูงสุด 25% แต่อาจขาดทุนได้ถึง 15%" ,value: "4"}
                    ]
                },
                {
                    number: 8,
                    ask: 'ถ้าคุณเลือกลงทุนในทรัพย์สินที่มีโอกาสได้รับผลตอบแทนมาก แต่มีโอกาสขาดทุนสูงด้วยเช่นกัน คุณจะรู้สึกอย่างไร',
                    choice: [
                        { text: "กังวลและตื่นตระหนกกลัวขาดทุน",value: "1"},
                        { text: "ไม่สบายใจแต่พอเข้าใจได้บ้าง" ,value: "2"},
                        { text: "เข้าใจและรับความผันผวนได้ในระดับหนึ่ง" ,value: "3"},
                        { text: "ไม่กังวลกับโอกาสขาดทุนสูง และหวังกับผลตอบแทนที่อาจจะได้รับสูงขึ้น" ,value: "4"}
                    ]
                },
                {
                    number: 9,
                    ask: 'คุณจะรู้สึกกังวล/รับไม่ได้ เมื่อมูลค่าเงินลงทุนของคุณมีการปรับตัวลดลงในสัดส่วนเท่าใด',
                    choice: [
                        { text: "5% หรือน้อยกว่า",value: "1"},
                        { text: "มากกว่า 5 -10%" ,value: "2"},
                        { text: "มากกว่า 10 -20%" ,value: "3"},
                        { text: "มากกว่า 20% ขึ้นไป" ,value: "4"}
                    ]
                },
                {
                    number: 10,
                    ask: 'หากปีที่แล้วคุณลงทุนไป 100,000 บาท ปี นี้คุณพบว่ามูลค่าเงินลงทุนลดลงเหลือ 85,000 บาท คุณจะทำอย่างไร',
                    choice: [
                        { text: "ตกใจ และต้องการขายการลงทุนที่เหลือทิ้ง",value: "1"},
                        { text: "กังวลใจ และจะปรับเปลี่ยนการลงทุนบางส่วนไปในทรัพย์สินที่เสี่ยงน้อยลง" ,value: "2"},
                        { text: "อดทนถือต่อเพื่อรอผลตอบแทนปรับตัวกลับมา" ,value: "3"},
                        { text: "ไม่กังวลใจ เพราะเข้าใจในการลงทุนระยะยาวและอาจเพิ่มเงินลงทุนในแบบเดิมเพื่อเฉลี่ยต้นทุน" ,value: "4"}
                    ]
                }
            // question tag
            ],
        }
    },
    methods: {

    }
}
</script>