<template>
    <div>
        <!-- <ResultCard/> -->
        <!-- <QuestionTemplate v-for="q in question" :key="q.number">
            <template v-slot:header>
                <span>คำถามความเสี่ยง</span>
            </template>
            <template v-slot:question>
                <span>ข้อ {{q.number}}. {{q.ask}}</span>
            </template>
            <template v-slot:choice>
                <ul>
                    <li v-for="c in q.choice" :key="c">{{q.choice.indexOf(c)+1}}. {{c}}</li>
                </ul>
            </template>
        </QuestionTemplate> -->

        <QuestionTemplate v-bind:question=question></QuestionTemplate>
        
    </div>
</template>

<script>
// import ResultCard from "@/components/ResultCard.vue";
import QuestionTemplate from "@/components/QuestionTemplate.vue";
export default {
    name : 'Question',
    components : {
        // ResultCard,
        QuestionTemplate,
    },
    data(){
        return{
            user: "",
            question:[
                {
                    number: 1,
                    ask: 'ปัจจุบันคุณอายุเท่าไหร่',
                    choice: [
                        { text: "มากกว่า 55 ปี" ,value: "1" },
                        { text: "45 – 55 ปี" ,value: "2" },
                        { text: "35 – 44 ปี" ,value: "3" },
                        { text: "น้อยกว่า 35 ปี" ,value: "4" }
                    ]
                },
                {
                    number: 2,
                    ask: 'ปัจจุบันคุณมีภาระค่าใช้จ่ายรายเดือน คิดเป็นกี่% ของรายได้ทั้งหมด',
                    choice: [
                        { text: "มากกว่า 75%",correct: true },
                        { text: "51 - 75%" },
                        { text: "25 - 50%" },
                        { text: "น้อยกว่า 25%" }
                    ]
                },
                {
                    number: 3,
                    ask: 'คุณมีสถานะทางการเงินในปัจจุบันอย่างไร',
                    choice: [
                        { text: "มีทรัพย์สินน้อยกว่าหนี้สิน",correct: true },
                        { text: "มีทรัพย์สินเท่ากับหนี้สิน" },
                        { text: "มีทรัพย์สินมากกว่าหนี้สิน" },
                        { text: "มีความมั่นใจว่ามีเงินออม/เงินลงทุนเพียงพอสำหรับการใช้ชีวิตหลังเกษียณแล้ว" }
                    ]
                },
                {
                    number: 4,
                    ask: 'คุณมีประสบการณ์ หรือมีความรู้ในการลงทุนในทรัพย์สินกลุ่มใดต่อไปนี้บ้าง',
                    choice: [
                        { text: "เงินฝากธนาคาร",correct: true },
                        { text: "พันธบัตรรัฐบาล หรือกองทุนรวมพันธบัตรรัฐบาล" },
                        { text: "หุ้นกู้ หรือกองทุนรวมตราสารหนี้" },
                        { text: "หุ้นสามัญ หรือกองทุนรวมหุ้น หรือสินทรัพย์อื่นที่มีความเสี่ยงสูง" }
                    ]
                },
                {
                    number: 5,
                    ask: 'คุณคาดว่าจะไม่มีความจำเป็ นต้องใช้เงินลงทุนนี้นานแค่ไหน',
                    choice: [
                        { text: "ไม่เกิน 1 ปี",correct: true },
                        { text: "1 – 3 ปี" },
                        { text: "3 – 5 ปี" },
                        { text: "มากกว่า 5 ปี" }
                    ]
                },
                {
                    number: 6,
                    ask: 'เป้าหมายหลักในการลงทุนของคุณ คือ',
                    choice: [
                        { text: "เงินต้นต้องไม่ลดลง และรับได้หากผลตอบแทนต่ำกว่าหรือใกล้เคียงอัตราเงินเฟ้อ",correct: true },
                        { text: "ได้รับผลตอบแทนที่สูงกว่าอัตราเงินเฟ้อเล็กน้อย และรับความเสี่ยงที่จะขาดทุนเงินต้นได้บ้าง" },
                        { text: "ได้รับผลตอบแทนที่สูงกว่าอัตราเงินเฟ้อ และรับความเสี่ยงที่จะขาดทุนเงินต้นได้มากขึ้น" },
                        { text: "ได้รับผลตอบแทนที่สูงมาก และรับความเสี่ยงที่จะขาดทุนเงินต้นส่วนใหญ่ได้" }
                    ]
                },
                {
                    number: 7,
                    ask: 'เมื่อพิจารณารูปแสดงตัวอย่างผลตอบแทนของกลุ่มการลงทุนที่อาจเกิดขึ้นด้านล่าง คุณเต็มใจที่จะลงทุนในแบบใด',
                    choice: [
                        { text: "แบบที่ 1 มีโอกาสได้รับผลตอบแทนสูงสุด 2.5% โดยไม่ขาดทุนเลย",correct: true },
                        { text: "แบบที่ 2 มีโอกาสได้รับผลตอบแทนสูงสุด 7% แต่อาจขาดทุนได้ถึง 1%" },
                        { text: "แบบที่ 3 มีโอกาสได้รับผลตอบแทนสูงสุด 15% แต่อาจขาดทุนได้ถึง 5%" },
                        { text: "แบบที่ 4 มีโอกาสได้รับผลตอบแทนสูงสุด 25% แต่อาจขาดทุนได้ถึง 15%" }
                    ]
                },
                {
                    number: 8,
                    ask: 'ถ้าคุณเลือกลงทุนในทรัพย์สินที่มีโอกาสได้รับผลตอบแทนมาก แต่มีโอกาสขาดทุนสูงด้วยเช่นกัน คุณจะรู้สึกอย่างไร',
                    choice: [
                        { text: "กังวลและตื่นตระหนกกลัวขาดทุน",correct: true },
                        { text: "ไม่สบายใจแต่พอเข้าใจได้บ้าง" },
                        { text: "เข้าใจและรับความผันผวนได้ในระดับหนึ่ง" },
                        { text: "ไม่กังวลกับโอกาสขาดทุนสูง และหวังกับผลตอบแทนที่อาจจะได้รับสูงขึ ้น" }
                    ]
                },
                {
                    number: 9,
                    ask: 'คุณจะรู้สึกกังวล/รับไม่ได้ เมื่อมูลค่าเงินลงทุนของคุณมีการปรับตัวลดลงในสัดส่วนเท่าใด',
                    choice: [
                        { text: "5% หรือน้อยกว่า",correct: true },
                        { text: "มากกว่า 5 -10%" },
                        { text: "มากกว่า 10 -20%" },
                        { text: "มากกว่า 20% ขึ้นไป" }
                    ]
                },
                {
                    number: 10,
                    ask: 'หากปีที่แล้วคุณลงทุนไป 100,000 บาท ปี นี้คุณพบว่ามูลค่าเงินลงทุนลดลงเหลือ 85,000 บาท คุณจะทำอย่างไร',
                    choice: [
                        { text: "ตกใจ และต้องการขายการลงทุนที่เหลือทิ้ง",correct: true },
                        { text: "กังวลใจ และจะปรับเปลี่ยนการลงทุนบางส่วนไปในทรัพย์สินที่เสี่ยงน้อยลง" },
                        { text: "อดทนถือต่อเพื่อรอผลตอบแทนปรับตัวกลับมา" },
                        { text: "ไม่กังวลใจ เพราะเข้าใจในการลงทุนระยะยาวและอาจเพิ่มเงินลงทุนในแบบเดิมเพื่อเฉลี่ยต้นทุน" }
                    ]
                }
            ]
        }
    }
}
</script>